app/controllers/brackets_controller.rb

  def show
    @bracket = Bracket.find(params[:id])
    @players = @bracket.seats.map(&:player)
---
SELECT "players".* FROM "players" WHERE "players"."bracket_id" = ?  [["bracket_id", 9]]