app/controllers/brackets_controller.rb

  def create
    bracket_params = params.require(:bracket).permit(players: [:name])
    @bracket = Bracket.new

    # Generate a Double Elimination bracket template for 12 players
    num_players = 8
    template = BracketTree::Template::SingleElimination.by_size(num_players)

    # Seed the bracket with player data
    players_data = bracket_params[:players].values
    players = []

    players_data.each do |player_data|
      name = player_data[:name]
      players << Player.new(name: name)
    end

    @bracket.players = players

    player_count = players.size

    @bracket.rounds = Math.log2(player_count).ceil
    @bracket.matches = player_count - 1

    if @bracket.save
---
INSERT INTO "players" ("created_at", "updated_at", "name", "bracket_id") VALUES (?, ?, ?, ?)  [["created_at", "2023-09-20 21:47:23.904084"], ["updated_at", "2023-09-20 21:47:23.904084"], ["name", "Player0"], ["bracket_id", nil]]
INSERT INTO "brackets" ("name", "position", "created_at", "updated_at", "player", "team", "rounds", "matches") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", nil], ["position", nil], ["created_at", "2023-09-19 23:34:03.526064"], ["updated_at", "2023-09-19 23:34:03.526064"], ["player", nil], ["team", nil], ["rounds", 3], ["matches", 7]]
INSERT INTO "players" ("created_at", "updated_at", "name", "bracket_id") VALUES (?, ?, ?, ?)  [["created_at", "2023-09-19 23:34:03.532324"], ["updated_at", "2023-09-19 23:34:03.532324"], ["name", "a"], ["bracket_id", 7]]

  def show
    @bracket = Bracket.find(params[:id])
---
SELECT "brackets".* FROM "brackets" WHERE "brackets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]